web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_Intra_CA_v12.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/ship/v12">
   <soapenv:Header/>
   <soapenv:Body>
      <v12:ProcessShipmentRequest>
         <v12:WebAuthenticationDetail>
            <v12:UserCredential>
               <v12:Key></v12:Key>
               <v12:Password/>
            </v12:UserCredential>
         </v12:WebAuthenticationDetail>
         <v12:ClientDetail>
            <v12:AccountNumber></v12:AccountNumber>
            <v12:MeterNumber></v12:MeterNumber>
         </v12:ClientDetail>
         <v12:TransactionDetail>
            <v12:CustomerTransactionId>ship_v12</v12:CustomerTransactionId>
         </v12:TransactionDetail>
         <v12:Version>
            <v12:ServiceId>ship</v12:ServiceId>
            <v12:Major>12</v12:Major>
            <v12:Intermediate>1</v12:Intermediate>
            <v12:Minor>0</v12:Minor>
         </v12:Version>
         <v12:RequestedShipment>
            <v12:ShipTimestamp>2010-11-16T09:30:47-05:00</v12:ShipTimestamp>
            <v12:DropoffType>REGULAR_PICKUP</v12:DropoffType>
            <v12:ServiceType>PRIORITY_OVERNIGHT</v12:ServiceType>
            <v12:PackagingType>YOUR_PACKAGING</v12:PackagingType>
            <v12:TotalWeight>
               <v12:Units>LB</v12:Units>
               <v12:Value>50.0</v12:Value>
            </v12:TotalWeight>
            <v12:Shipper>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Contact>
                  <v12:CompanyName>FedEx-WAPI</v12:CompanyName>
                  <v12:PhoneNumber>1234567890</v12:PhoneNumber>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>Recipient Address Line 1</v12:StreetLines>
                  <v12:City>Auburn</v12:City>
                  <v12:StateOrProvinceCode>ON</v12:StateOrProvinceCode>
                  <v12:PostalCode>N1R7J5</v12:PostalCode>
                  <v12:CountryCode>CA</v12:CountryCode>
                  <v12:Residential>1</v12:Residential>
               </v12:Address>
            </v12:Shipper>
            <v12:Recipient>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Contact>
                  <v12:PersonName>Abhay Palaskar</v12:PersonName>
                  <v12:PhoneNumber>7894561230</v12:PhoneNumber>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>Recipient Address Line 1</v12:StreetLines>
                  <v12:City>Auburn</v12:City>
                  <v12:StateOrProvinceCode>ON</v12:StateOrProvinceCode>
                  <v12:PostalCode>N1R7J5</v12:PostalCode>
                  <v12:CountryCode>CA</v12:CountryCode>
                  <v12:Residential>1</v12:Residential>
               </v12:Address>
            </v12:Recipient>
            <v12:ShippingChargesPayment>
               <v12:PaymentType>SENDER</v12:PaymentType>
               <v12:Payor>
                  <v12:ResponsibleParty>
                     <v12:AccountNumber></v12:AccountNumber>
                     <v12:Contact>
                        <v12:CompanyName>FedEx-WAPI</v12:CompanyName>
                        <v12:PhoneNumber>1234567890</v12:PhoneNumber>
                     </v12:Contact>
                     <v12:Address>
                        <v12:StreetLines>Recipient Address Line 1</v12:StreetLines>
                        <v12:City>Auburn</v12:City>
                        <v12:StateOrProvinceCode>ON</v12:StateOrProvinceCode>
                        <v12:PostalCode>N1R7J5</v12:PostalCode>
                        <v12:CountryCode>CA</v12:CountryCode>
                        <v12:Residential>1</v12:Residential>
                     </v12:Address>
                  </v12:ResponsibleParty>
               </v12:Payor>
            </v12:ShippingChargesPayment>
            <v12:CustomsClearanceDetail>
               <v12:DutiesPayment>
                  <v12:PaymentType>SENDER</v12:PaymentType>
                  <v12:Payor>
                     <v12:ResponsibleParty>
                        <v12:AccountNumber></v12:AccountNumber>
                        <v12:Contact>
                           <v12:CompanyName>FedEx-WAPI</v12:CompanyName>
                           <v12:PhoneNumber>1234567890</v12:PhoneNumber>
                        </v12:Contact>
                        <v12:Address>
                           <v12:StreetLines>Recipient Address Line 1</v12:StreetLines>
                           <v12:City>Auburn</v12:City>
                           <v12:StateOrProvinceCode>ON</v12:StateOrProvinceCode>
                           <v12:PostalCode>N1R7J5</v12:PostalCode>
                           <v12:CountryCode>CA</v12:CountryCode>
                           <v12:Residential>1</v12:Residential>
                        </v12:Address>
                     </v12:ResponsibleParty>
                  </v12:Payor>
               </v12:DutiesPayment>
               <v12:DocumentContent>DOCUMENTS_ONLY</v12:DocumentContent>
               <v12:CustomsValue>
                  <v12:Currency>USD</v12:Currency>
                  <v12:Amount>2500.000000</v12:Amount>
               </v12:CustomsValue>
               <v12:InsuranceCharges>
                  <v12:Currency>USD</v12:Currency>
                  <v12:Amount>15.00</v12:Amount>
               </v12:InsuranceCharges>
               <v12:Commodities>
                  <v12:NumberOfPieces>1</v12:NumberOfPieces>
                  <v12:Description>ABCD</v12:Description>
                  <v12:CountryOfManufacture>US</v12:CountryOfManufacture>
                  <v12:HarmonizedCode>84212100</v12:HarmonizedCode>
                  <v12:Weight>
                     <v12:Units>LB</v12:Units>
                     <v12:Value>10.0</v12:Value>
                  </v12:Weight>
                  <v12:Quantity>250</v12:Quantity>
                  <v12:QuantityUnits>LITERS</v12:QuantityUnits>
                  <v12:UnitPrice>
                     <v12:Currency>USD</v12:Currency>
                     <v12:Amount>1.000000</v12:Amount>
                  </v12:UnitPrice>
                  <v12:CustomsValue>
                     <v12:Currency>USD</v12:Currency>
                     <v12:Amount>2500.000000</v12:Amount>
                  </v12:CustomsValue>
               </v12:Commodities>
            </v12:CustomsClearanceDetail>
            <v12:LabelSpecification>
               <v12:LabelFormatType>COMMON2D</v12:LabelFormatType>
               <v12:ImageType>PNG</v12:ImageType>
               <v12:LabelStockType>PAPER_4X6</v12:LabelStockType>
            </v12:LabelSpecification>
            <v12:RateRequestTypes>ACCOUNT</v12:RateRequestTypes>
            <v12:PackageCount>1</v12:PackageCount>
            <v12:RequestedPackageLineItems>
               <v12:SequenceNumber>1</v12:SequenceNumber>
               <v12:GroupNumber>1</v12:GroupNumber>
               <v12:GroupPackageCount>1</v12:GroupPackageCount>
               <v12:Weight>
                  <v12:Units>LB</v12:Units>
                  <v12:Value>20.0</v12:Value>
               </v12:Weight>
               <v12:Dimensions>
                  <v12:Length>12</v12:Length>
                  <v12:Width>12</v12:Width>
                  <v12:Height>12</v12:Height>
                  <v12:Units>IN</v12:Units>
               </v12:Dimensions>
               <v12:SpecialServicesRequested>
                  <v12:SpecialServiceTypes>DANGEROUS_GOODS</v12:SpecialServiceTypes>
                  <v12:DangerousGoodsDetail>
                     <v12:Accessibility>ACCESSIBLE</v12:Accessibility>
                  </v12:DangerousGoodsDetail>
               </v12:SpecialServicesRequested>
               <v12:ContentRecords>
                  <v12:PartNumber>123445</v12:PartNumber>
                  <v12:ItemNumber>kjdjalsro1262739827</v12:ItemNumber>
                  <v12:ReceivedQuantity>12</v12:ReceivedQuantity>
                  <v12:Description>ContentDescription</v12:Description>
               </v12:ContentRecords>
            </v12:RequestedPackageLineItems>
         </v12:RequestedShipment>
      </v12:ProcessShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>